RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the STD field to a new value. */
#define CAN_WR_ID_STD(base, index, value) (CAN_RMW_ID(base, index, CAN_ID_STD_MASK, CAN_ID_STD(value)))
#define CAN_BWR_ID_STD(base, index, value) (BME_BFI32(&CAN_ID_REG(base, index), ((uint32_t)(value) << CAN_ID_STD_SHIFT), CAN_ID_STD_SHIFT, CAN_ID_STD_WIDTH))
/*@}*/

/*!
 * @name Register CAN_ID, field PRIO[31:29] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_ID_PRIO field. */
#define CAN_RD_ID_PRIO(base, index) ((CAN_ID_REG(base, index) & CAN_ID_PRIO_MASK) >> CAN_ID_PRIO_SHIFT)
#define CAN_BRD_ID_PRIO(base, index) (BME_UBFX32(&CAN_ID_REG(base, index), CAN_ID_PRIO_SHIFT, CAN_ID_PRIO_WIDTH))

/*! @brief Set the PRIO field to a new value. */
#define CAN_WR_ID_PRIO(base, index, value) (CAN_RMW_ID(base, index, CAN_ID_PRIO_MASK, CAN_ID_PRIO(value)))
#define CAN_BWR_ID_PRIO(base, index, value) (BME_BFI32(&CAN_ID_REG(base, index), ((uint32_t)(value) << CAN_ID_PRIO_SHIFT), CAN_ID_PRIO_SHIFT, CAN_ID_PRIO_WIDTH))
/*@}*/

/*******************************************************************************
 * CAN_WORD0 - Message Buffer 0 WORD0 Register
 ******************************************************************************/

/*!
 * @brief CAN_WORD0 - Message Buffer 0 WORD0 Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_WORD0 register
 */
/*@{*/
#define CAN_RD_WORD0(base, index) (CAN_WORD0_REG(base, index))
#define CAN_WR_WORD0(base, index, value) (CAN_WORD0_REG(base, index) = (value))
#define CAN_RMW_WORD0(base, index, mask, value) (CAN_WR_WORD0(base, index, (CAN_RD_WORD0(base, index) & ~(mask)) | (value)))
#define CAN_SET_WORD0(base, index, value) (BME_OR32(&CAN_WORD0_REG(base, index), (uint32_t)(value)))
#define CAN_CLR_WORD0(base, index, value) (BME_AND32(&CAN_WORD0_REG(base, index), (uint32_t)(~(value))))
#define CAN_TOG_WORD0(base, index, value) (BME_XOR32(&CAN_WORD0_REG(base, index), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual CAN_WORD0 bitfields
 */

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_3[7:0] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_3 field. */
#define CAN_RD_WORD0_DATA_BYTE_3(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_3_MASK) >> CAN_WORD0_DATA_BYTE_3_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_3(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_3_SHIFT, CAN_WORD0_DATA_BYTE_3_WIDTH))

/*! @brief Set the DATA_BYTE_3 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_3(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_3_MASK, CAN_WORD0_DATA_BYTE_3(value)))
#define CAN_BWR_WORD0_DATA_BYTE_3(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_3_SHIFT), CAN_WORD0_DATA_BYTE_3_SHIFT, CAN_WORD0_DATA_BYTE_3_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_2[15:8] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_2 field. */
#define CAN_RD_WORD0_DATA_BYTE_2(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_2_MASK) >> CAN_WORD0_DATA_BYTE_2_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_2(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_2_SHIFT, CAN_WORD0_DATA_BYTE_2_WIDTH))

/*! @brief Set the DATA_BYTE_2 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_2(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_2_MASK, CAN_WORD0_DATA_BYTE_2(value)))
#define CAN_BWR_WORD0_DATA_BYTE_2(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_2_SHIFT), CAN_WORD0_DATA_BYTE_2_SHIFT, CAN_WORD0_DATA_BYTE_2_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_1[23:16] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_1 field. */
#define CAN_RD_WORD0_DATA_BYTE_1(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_1_MASK) >> CAN_WORD0_DATA_BYTE_1_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_1(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_1_SHIFT, CAN_WORD0_DATA_BYTE_1_WIDTH))

/*! @brief Set the DATA_BYTE_1 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_1(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_1_MASK, CAN_WORD0_DATA_BYTE_1(value)))
#define CAN_BWR_WORD0_DATA_BYTE_1(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_1_SHIFT), CAN_WORD0_DATA_BYTE_1_SHIFT, CAN_WORD0_DATA_BYTE_1_WIDTH))
/*@}*/

/*!
 * @name Register CAN_WORD0, field DATA_BYTE_0[31:24] (RW)
 */
/*@{*/
/*! @brief Read current value of the CAN_WORD0_DATA_BYTE_0 field. */
#define CAN_RD_WORD0_DATA_BYTE_0(base, index) ((CAN_WORD0_REG(base, index) & CAN_WORD0_DATA_BYTE_0_MASK) >> CAN_WORD0_DATA_BYTE_0_SHIFT)
#define CAN_BRD_WORD0_DATA_BYTE_0(base, index) (BME_UBFX32(&CAN_WORD0_REG(base, index), CAN_WORD0_DATA_BYTE_0_SHIFT, CAN_WORD0_DATA_BYTE_0_WIDTH))

/*! @brief Set the DATA_BYTE_0 field to a new value. */
#define CAN_WR_WORD0_DATA_BYTE_0(base, index, value) (CAN_RMW_WORD0(base, index, CAN_WORD0_DATA_BYTE_0_MASK, CAN_WORD0_DATA_BYTE_0(value)))
#define CAN_BWR_WORD0_DATA_BYTE_0(base, index, value) (BME_BFI32(&CAN_WORD0_REG(base, index), ((uint32_t)(value) << CAN_WORD0_DATA_BYTE_0_SHIFT), CAN_WORD0_DATA_BYTE_0_SHIFT, CAN_WORD0_DATA_BYTE_0_WIDTH))
/*@}*/

/*******************************************************************************
 * CAN_WORD1 - Message Buffer 0 WORD1 Register
 ******************************************************************************/

/*!
 * @brief CAN_WORD1 - Message Buffer 0 WORD1 Register (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire CAN_WORD1 register
 */
/*@{*/
#define CAN_RD_WORD1(base, index) (CAN_WORD1_REG(base, index))
#define CAN_WR_WORD1(base, index, value) (CAN_WORD1_REG(base, index) = (value))
#define CAN_RMW_WORD1(base, index, mask, value) (CAN_WR_WORD1(base, index, (CAN_RD_WORD1(base, index) & ~(mask)) | (value)))
#define CAN_SET_WORD1(base, index, value) (BME_OR32(&CAN_WORD1_REG(base, index), (uint32_t)(value)))
#define CAN_CLR_WORD1(base, index, value) (BME_AND32(&CAN_WORD1_REG(base, index), (uint32_t)(~(value))))
#define CAN_TOG_WORD1(base, index, value) (BME_XOR32(&CAN_WORD1_REG(base, index), (uint32_t)(value)))
/*@}*/

