RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the UART0ODE field to a new value. */
#define SIM_WR_SOPT5_UART0ODE(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART0ODE_MASK, SIM_SOPT5_UART0ODE(value)))
#define SIM_BWR_SOPT5_UART0ODE(base, value) (BME_BFI32(&SIM_SOPT5_REG(base), ((uint32_t)(value) << SIM_SOPT5_UART0ODE_SHIFT), SIM_SOPT5_UART0ODE_SHIFT, SIM_SOPT5_UART0ODE_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT5, field UART1ODE[17] (RW)
 *
 * Values:
 * - 0b0 - Open drain is disabled on UART1
 * - 0b1 - Open drain is enabled on UART1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT5_UART1ODE field. */
#define SIM_RD_SOPT5_UART1ODE(base) ((SIM_SOPT5_REG(base) & SIM_SOPT5_UART1ODE_MASK) >> SIM_SOPT5_UART1ODE_SHIFT)
#define SIM_BRD_SOPT5_UART1ODE(base) (BME_UBFX32(&SIM_SOPT5_REG(base), SIM_SOPT5_UART1ODE_SHIFT, SIM_SOPT5_UART1ODE_WIDTH))

/*! @brief Set the UART1ODE field to a new value. */
#define SIM_WR_SOPT5_UART1ODE(base, value) (SIM_RMW_SOPT5(base, SIM_SOPT5_UART1ODE_MASK, SIM_SOPT5_UART1ODE(value)))
#define SIM_BWR_SOPT5_UART1ODE(base, value) (BME_BFI32(&SIM_SOPT5_REG(base), ((uint32_t)(value) << SIM_SOPT5_UART1ODE_SHIFT), SIM_SOPT5_UART1ODE_SHIFT, SIM_SOPT5_UART1ODE_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT6 - Systems Option Register 6
 ******************************************************************************/

/*!
 * @brief SIM_SOPT6 - Systems Option Register 6 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT6 register
 */
/*@{*/
#define SIM_RD_SOPT6(base)       (SIM_SOPT6_REG(base))
#define SIM_WR_SOPT6(base, value) (SIM_SOPT6_REG(base) = (value))
#define SIM_RMW_SOPT6(base, mask, value) (SIM_WR_SOPT6(base, (SIM_RD_SOPT6(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT6(base, value) (BME_OR32(&SIM_SOPT6_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT6(base, value) (BME_AND32(&SIM_SOPT6_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT6(base, value) (BME_XOR32(&SIM_SOPT6_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT6 bitfields
 */

/*!
 * @name Register SIM_SOPT6, field FTM3FLT0[0] (RW)
 *
 * Values:
 * - 0b0 - FTM3_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM3FLT0 field. */
#define SIM_RD_SOPT6_FTM3FLT0(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM3FLT0_MASK) >> SIM_SOPT6_FTM3FLT0_SHIFT)
#define SIM_BRD_SOPT6_FTM3FLT0(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM3FLT0_SHIFT, SIM_SOPT6_FTM3FLT0_WIDTH))

/*! @brief Set the FTM3FLT0 field to a new value. */
#define SIM_WR_SOPT6_FTM3FLT0(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM3FLT0_MASK, SIM_SOPT6_FTM3FLT0(value)))
#define SIM_BWR_SOPT6_FTM3FLT0(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM3FLT0_SHIFT), SIM_SOPT6_FTM3FLT0_SHIFT, SIM_SOPT6_FTM3FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4FLT0[2] (RW)
 *
 * Values:
 * - 0b0 - FTM4_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4FLT0 field. */
#define SIM_RD_SOPT6_FTM4FLT0(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4FLT0_MASK) >> SIM_SOPT6_FTM4FLT0_SHIFT)
#define SIM_BRD_SOPT6_FTM4FLT0(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4FLT0_SHIFT, SIM_SOPT6_FTM4FLT0_WIDTH))

/*! @brief Set the FTM4FLT0 field to a new value. */
#define SIM_WR_SOPT6_FTM4FLT0(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4FLT0_MASK, SIM_SOPT6_FTM4FLT0(value)))
#define SIM_BWR_SOPT6_FTM4FLT0(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4FLT0_SHIFT), SIM_SOPT6_FTM4FLT0_SHIFT, SIM_SOPT6_FTM4FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5FLT0[3] (RW)
 *
 * Values:
 * - 0b0 - FTM5_FLT0 pin
 * - 0b1 - CMP0 out
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5FLT0 field. */
#define SIM_RD_SOPT6_FTM5FLT0(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5FLT0_MASK) >> SIM_SOPT6_FTM5FLT0_SHIFT)
#define SIM_BRD_SOPT6_FTM5FLT0(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5FLT0_SHIFT, SIM_SOPT6_FTM5FLT0_WIDTH))

/*! @brief Set the FTM5FLT0 field to a new value. */
#define SIM_WR_SOPT6_FTM5FLT0(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5FLT0_MASK, SIM_SOPT6_FTM5FLT0(value)))
#define SIM_BWR_SOPT6_FTM5FLT0(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5FLT0_SHIFT), SIM_SOPT6_FTM5FLT0_SHIFT, SIM_SOPT6_FTM5FLT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM3TRG0SRC[7] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM3 hardware trigger 0
 * - 0b1 - FTM5 channel match drives FTM3 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM3TRG0SRC field. */
#define SIM_RD_SOPT6_FTM3TRG0SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM3TRG0SRC_MASK) >> SIM_SOPT6_FTM3TRG0SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM3TRG0SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM3TRG0SRC_SHIFT, SIM_SOPT6_FTM3TRG0SRC_WIDTH))

/*! @brief Set the FTM3TRG0SRC field to a new value. */
#define SIM_WR_SOPT6_FTM3TRG0SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM3TRG0SRC_MASK, SIM_SOPT6_FTM3TRG0SRC(value)))
#define SIM_BWR_SOPT6_FTM3TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM3TRG0SRC_SHIFT), SIM_SOPT6_FTM3TRG0SRC_SHIFT, SIM_SOPT6_FTM3TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM3TRG1SRC[8] (RW)
 *
 * Values:
 * - 0b0 - PDB1 output drives FTM3 hardware trigger 1
 * - 0b1 - FTM4 channel match drives FTM3 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM3TRG1SRC field. */
#define SIM_RD_SOPT6_FTM3TRG1SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM3TRG1SRC_MASK) >> SIM_SOPT6_FTM3TRG1SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM3TRG1SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM3TRG1SRC_SHIFT, SIM_SOPT6_FTM3TRG1SRC_WIDTH))

/*! @brief Set the FTM3TRG1SRC field to a new value. */
#define SIM_WR_SOPT6_FTM3TRG1SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM3TRG1SRC_MASK, SIM_SOPT6_FTM3TRG1SRC(value)))
#define SIM_BWR_SOPT6_FTM3TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM3TRG1SRC_SHIFT), SIM_SOPT6_FTM3TRG1SRC_SHIFT, SIM_SOPT6_FTM3TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM3TRG2SRC[9] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM3 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM3 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM3TRG2SRC field. */
#define SIM_RD_SOPT6_FTM3TRG2SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM3TRG2SRC_MASK) >> SIM_SOPT6_FTM3TRG2SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM3TRG2SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM3TRG2SRC_SHIFT, SIM_SOPT6_FTM3TRG2SRC_WIDTH))

/*! @brief Set the FTM3TRG2SRC field to a new value. */
#define SIM_WR_SOPT6_FTM3TRG2SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM3TRG2SRC_MASK, SIM_SOPT6_FTM3TRG2SRC(value)))
#define SIM_BWR_SOPT6_FTM3TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM3TRG2SRC_SHIFT), SIM_SOPT6_FTM3TRG2SRC_SHIFT, SIM_SOPT6_FTM3TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4TRG0SRC[10] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM4 hardware trigger 0
 * - 0b1 - FTM3 channel match drives FTM4 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4TRG0SRC field. */
#define SIM_RD_SOPT6_FTM4TRG0SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4TRG0SRC_MASK) >> SIM_SOPT6_FTM4TRG0SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM4TRG0SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4TRG0SRC_SHIFT, SIM_SOPT6_FTM4TRG0SRC_WIDTH))

