RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the FTM4TRG0SRC field to a new value. */
#define SIM_WR_SOPT6_FTM4TRG0SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4TRG0SRC_MASK, SIM_SOPT6_FTM4TRG0SRC(value)))
#define SIM_BWR_SOPT6_FTM4TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4TRG0SRC_SHIFT), SIM_SOPT6_FTM4TRG0SRC_SHIFT, SIM_SOPT6_FTM4TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4TRG1SRC[11] (RW)
 *
 * Values:
 * - 0b0 - PDB1 output trigger 1 drives FTM4 hardware trigger 1
 * - 0b1 - FTM5 channel match drives FTM4 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4TRG1SRC field. */
#define SIM_RD_SOPT6_FTM4TRG1SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4TRG1SRC_MASK) >> SIM_SOPT6_FTM4TRG1SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM4TRG1SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4TRG1SRC_SHIFT, SIM_SOPT6_FTM4TRG1SRC_WIDTH))

/*! @brief Set the FTM4TRG1SRC field to a new value. */
#define SIM_WR_SOPT6_FTM4TRG1SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4TRG1SRC_MASK, SIM_SOPT6_FTM4TRG1SRC(value)))
#define SIM_BWR_SOPT6_FTM4TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4TRG1SRC_SHIFT), SIM_SOPT6_FTM4TRG1SRC_SHIFT, SIM_SOPT6_FTM4TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4TRG2SRC[12] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM4 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM4 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4TRG2SRC field. */
#define SIM_RD_SOPT6_FTM4TRG2SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4TRG2SRC_MASK) >> SIM_SOPT6_FTM4TRG2SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM4TRG2SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4TRG2SRC_SHIFT, SIM_SOPT6_FTM4TRG2SRC_WIDTH))

/*! @brief Set the FTM4TRG2SRC field to a new value. */
#define SIM_WR_SOPT6_FTM4TRG2SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4TRG2SRC_MASK, SIM_SOPT6_FTM4TRG2SRC(value)))
#define SIM_BWR_SOPT6_FTM4TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4TRG2SRC_SHIFT), SIM_SOPT6_FTM4TRG2SRC_SHIFT, SIM_SOPT6_FTM4TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5TRG0SRC[13] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM5 hardware trigger 0
 * - 0b1 - FTM3 channel match drives FTM5 hardware trigger 0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5TRG0SRC field. */
#define SIM_RD_SOPT6_FTM5TRG0SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5TRG0SRC_MASK) >> SIM_SOPT6_FTM5TRG0SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM5TRG0SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5TRG0SRC_SHIFT, SIM_SOPT6_FTM5TRG0SRC_WIDTH))

/*! @brief Set the FTM5TRG0SRC field to a new value. */
#define SIM_WR_SOPT6_FTM5TRG0SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5TRG0SRC_MASK, SIM_SOPT6_FTM5TRG0SRC(value)))
#define SIM_BWR_SOPT6_FTM5TRG0SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5TRG0SRC_SHIFT), SIM_SOPT6_FTM5TRG0SRC_SHIFT, SIM_SOPT6_FTM5TRG0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5TRG1SRC[14] (RW)
 *
 * Values:
 * - 0b0 - PDB1 output trigger 1 drives FTM5 hardware trigger 1
 * - 0b1 - FTM4 channel match drives FTM5 hardware trigger 1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5TRG1SRC field. */
#define SIM_RD_SOPT6_FTM5TRG1SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5TRG1SRC_MASK) >> SIM_SOPT6_FTM5TRG1SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM5TRG1SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5TRG1SRC_SHIFT, SIM_SOPT6_FTM5TRG1SRC_WIDTH))

/*! @brief Set the FTM5TRG1SRC field to a new value. */
#define SIM_WR_SOPT6_FTM5TRG1SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5TRG1SRC_MASK, SIM_SOPT6_FTM5TRG1SRC(value)))
#define SIM_BWR_SOPT6_FTM5TRG1SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5TRG1SRC_SHIFT), SIM_SOPT6_FTM5TRG1SRC_SHIFT, SIM_SOPT6_FTM5TRG1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5TRG2SRC[15] (RW)
 *
 * Values:
 * - 0b0 - CMP0 output drives FTM5 hardware trigger 2
 * - 0b1 - CMP1 output drives FTM5 hardware trigger 2
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5TRG2SRC field. */
#define SIM_RD_SOPT6_FTM5TRG2SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5TRG2SRC_MASK) >> SIM_SOPT6_FTM5TRG2SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM5TRG2SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5TRG2SRC_SHIFT, SIM_SOPT6_FTM5TRG2SRC_WIDTH))

/*! @brief Set the FTM5TRG2SRC field to a new value. */
#define SIM_WR_SOPT6_FTM5TRG2SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5TRG2SRC_MASK, SIM_SOPT6_FTM5TRG2SRC(value)))
#define SIM_BWR_SOPT6_FTM5TRG2SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5TRG2SRC_SHIFT), SIM_SOPT6_FTM5TRG2SRC_SHIFT, SIM_SOPT6_FTM5TRG2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4CH0SRC[19:18] (RW)
 *
 * Selects the source for FTM4 channel 0 input capture.
 *
 * Values:
 * - 0b00 - FTM4_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4CH0SRC field. */
#define SIM_RD_SOPT6_FTM4CH0SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4CH0SRC_MASK) >> SIM_SOPT6_FTM4CH0SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM4CH0SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4CH0SRC_SHIFT, SIM_SOPT6_FTM4CH0SRC_WIDTH))

/*! @brief Set the FTM4CH0SRC field to a new value. */
#define SIM_WR_SOPT6_FTM4CH0SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4CH0SRC_MASK, SIM_SOPT6_FTM4CH0SRC(value)))
#define SIM_BWR_SOPT6_FTM4CH0SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4CH0SRC_SHIFT), SIM_SOPT6_FTM4CH0SRC_SHIFT, SIM_SOPT6_FTM4CH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5CH0SRC[21:20] (RW)
 *
 * Selects the source for FTM5 channel 0 input capture.
 *
 * Values:
 * - 0b00 - FTM5_CH0 signal
 * - 0b01 - CMP0 output
 * - 0b10 - CMP1 output
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5CH0SRC field. */
#define SIM_RD_SOPT6_FTM5CH0SRC(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5CH0SRC_MASK) >> SIM_SOPT6_FTM5CH0SRC_SHIFT)
#define SIM_BRD_SOPT6_FTM5CH0SRC(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5CH0SRC_SHIFT, SIM_SOPT6_FTM5CH0SRC_WIDTH))

