RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the FTM5CH0SRC field to a new value. */
#define SIM_WR_SOPT6_FTM5CH0SRC(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5CH0SRC_MASK, SIM_SOPT6_FTM5CH0SRC(value)))
#define SIM_BWR_SOPT6_FTM5CH0SRC(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5CH0SRC_SHIFT), SIM_SOPT6_FTM5CH0SRC_SHIFT, SIM_SOPT6_FTM5CH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM3CLKSEL[25:24] (RW)
 *
 * Values:
 * - 0b00 - FTM3 external clock driven by FTM_CLKIN0 pin
 * - 0b01 - FTM3 external clock driven by FTM_CLKIN1 pin
 * - 0b10 - FTM3 external clock driven by FTM_CLKIN2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM3CLKSEL field. */
#define SIM_RD_SOPT6_FTM3CLKSEL(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM3CLKSEL_MASK) >> SIM_SOPT6_FTM3CLKSEL_SHIFT)
#define SIM_BRD_SOPT6_FTM3CLKSEL(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM3CLKSEL_SHIFT, SIM_SOPT6_FTM3CLKSEL_WIDTH))

/*! @brief Set the FTM3CLKSEL field to a new value. */
#define SIM_WR_SOPT6_FTM3CLKSEL(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM3CLKSEL_MASK, SIM_SOPT6_FTM3CLKSEL(value)))
#define SIM_BWR_SOPT6_FTM3CLKSEL(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM3CLKSEL_SHIFT), SIM_SOPT6_FTM3CLKSEL_SHIFT, SIM_SOPT6_FTM3CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM4CLKSEL[27:26] (RW)
 *
 * Values:
 * - 0b00 - FTM4 external clock driven by FTM_CLKIN0 pin
 * - 0b01 - FTM4 external clock driven by FTM_CLKIN1 pin
 * - 0b10 - FTM4 external clock driven by FTM_CLKIN2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM4CLKSEL field. */
#define SIM_RD_SOPT6_FTM4CLKSEL(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM4CLKSEL_MASK) >> SIM_SOPT6_FTM4CLKSEL_SHIFT)
#define SIM_BRD_SOPT6_FTM4CLKSEL(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM4CLKSEL_SHIFT, SIM_SOPT6_FTM4CLKSEL_WIDTH))

/*! @brief Set the FTM4CLKSEL field to a new value. */
#define SIM_WR_SOPT6_FTM4CLKSEL(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM4CLKSEL_MASK, SIM_SOPT6_FTM4CLKSEL(value)))
#define SIM_BWR_SOPT6_FTM4CLKSEL(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM4CLKSEL_SHIFT), SIM_SOPT6_FTM4CLKSEL_SHIFT, SIM_SOPT6_FTM4CLKSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT6, field FTM5CLKSEL[29:28] (RW)
 *
 * Values:
 * - 0b00 - FTM5 external clock driven by FTM_CLKIN0 pin
 * - 0b01 - FTM5 external clock driven by FTM_CLKIN1 pin
 * - 0b10 - FTM5 external clock driven by FTM_CLKIN2 pin
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT6_FTM5CLKSEL field. */
#define SIM_RD_SOPT6_FTM5CLKSEL(base) ((SIM_SOPT6_REG(base) & SIM_SOPT6_FTM5CLKSEL_MASK) >> SIM_SOPT6_FTM5CLKSEL_SHIFT)
#define SIM_BRD_SOPT6_FTM5CLKSEL(base) (BME_UBFX32(&SIM_SOPT6_REG(base), SIM_SOPT6_FTM5CLKSEL_SHIFT, SIM_SOPT6_FTM5CLKSEL_WIDTH))

/*! @brief Set the FTM5CLKSEL field to a new value. */
#define SIM_WR_SOPT6_FTM5CLKSEL(base, value) (SIM_RMW_SOPT6(base, SIM_SOPT6_FTM5CLKSEL_MASK, SIM_SOPT6_FTM5CLKSEL(value)))
#define SIM_BWR_SOPT6_FTM5CLKSEL(base, value) (BME_BFI32(&SIM_SOPT6_REG(base), ((uint32_t)(value) << SIM_SOPT6_FTM5CLKSEL_SHIFT), SIM_SOPT6_FTM5CLKSEL_SHIFT, SIM_SOPT6_FTM5CLKSEL_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT7 - System Options Register 7
 ******************************************************************************/

/*!
 * @brief SIM_SOPT7 - System Options Register 7 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT7 register
 */
/*@{*/
#define SIM_RD_SOPT7(base)       (SIM_SOPT7_REG(base))
#define SIM_WR_SOPT7(base, value) (SIM_SOPT7_REG(base) = (value))
#define SIM_RMW_SOPT7(base, mask, value) (SIM_WR_SOPT7(base, (SIM_RD_SOPT7(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT7(base, value) (BME_OR32(&SIM_SOPT7_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT7(base, value) (BME_AND32(&SIM_SOPT7_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT7(base, value) (BME_XOR32(&SIM_SOPT7_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT7 bitfields
 */

/*!
 * @name Register SIM_SOPT7, field ADC0TRGSEL[3:0] (RW)
 *
 * Selects the ADC0 trigger source when alternative triggers are functional in
 * Stop and VLPS modes. .
 *
 * Values:
 * - 0b0000 - External trigger pin input (PDB_EXTRG0)
 * - 0b0001 - CMP0 output
 * - 0b0010 - CMP1 output
 * - 0b0011 - External trigger pin input (PDB_EXTRG1)
 * - 0b0100 - DMA channel 0 transfer last write complete
 * - 0b0101 - DMA channel 1 transfer last write complete
 * - 0b0110 - DMA channel 2 transfer last write complete
 * - 0b0111 - DMA channel 3 transfer last write complete
 * - 0b1000 - FTM0 intialtrig or external trig output
 * - 0b1001 - FTM1 intial trig or external trig output
 * - 0b1010 - FTM2 intial trig or external trig output
 * - 0b1011 - FTM3 intial trig or external trig output
 * - 0b1100 - FTM4 intial trig or external trig output
 * - 0b1101 - FTM5 intial trig or external trig output
 * - 0b1110 - LPTMR0 trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC0TRGSEL field. */
#define SIM_RD_SOPT7_ADC0TRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC0TRGSEL_MASK) >> SIM_SOPT7_ADC0TRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC0TRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC0TRGSEL_SHIFT, SIM_SOPT7_ADC0TRGSEL_WIDTH))

/*! @brief Set the ADC0TRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC0TRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC0TRGSEL_MASK, SIM_SOPT7_ADC0TRGSEL(value)))
#define SIM_BWR_SOPT7_ADC0TRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC0TRGSEL_SHIFT), SIM_SOPT7_ADC0TRGSEL_SHIFT, SIM_SOPT7_ADC0TRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC0PRETRGSEL[4] (RW)
 *
 * Selects the ADC0 pre-trigger source when alternative triggers are enabled
 * through ADC0ALTTRGEN.
 *
 * Values:
 * - 0b0 - Pre-trigger A for ADC0. Clearing this field will result in ADHWTSA=1
 *     and ADHWTSB=0.
 * - 0b1 - Pre-trigger B for ADC0. Setting this bit will result in ADHWTSA=0 and
 *     ADHWTSB=1.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC0PRETRGSEL field. */
#define SIM_RD_SOPT7_ADC0PRETRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC0PRETRGSEL_MASK) >> SIM_SOPT7_ADC0PRETRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC0PRETRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC0PRETRGSEL_SHIFT, SIM_SOPT7_ADC0PRETRGSEL_WIDTH))

/*! @brief Set the ADC0PRETRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC0PRETRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC0PRETRGSEL_MASK, SIM_SOPT7_ADC0PRETRGSEL(value)))
#define SIM_BWR_SOPT7_ADC0PRETRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC0PRETRGSEL_SHIFT), SIM_SOPT7_ADC0PRETRGSEL_SHIFT, SIM_SOPT7_ADC0PRETRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC0ALTTRGEN[7:6] (RW)
 *
 * Enable alternative conversion triggers for ADC0.
 *
 * Values:
 * - 0b00 - PDB0 CH0 triggers ADC0
 * - 0b01 - PDB1 CH0 triggers ADC0
 * - 0b10 - Alt trigger source as per ADC0TRGSEL
 * - 0b11 - PDB0 CH0 OR PDB1 CH0 trigger ADC0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC0ALTTRGEN field. */
#define SIM_RD_SOPT7_ADC0ALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC0ALTTRGEN_MASK) >> SIM_SOPT7_ADC0ALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADC0ALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC0ALTTRGEN_SHIFT, SIM_SOPT7_ADC0ALTTRGEN_WIDTH))

