RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the ADC0ALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADC0ALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC0ALTTRGEN_MASK, SIM_SOPT7_ADC0ALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADC0ALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC0ALTTRGEN_SHIFT), SIM_SOPT7_ADC0ALTTRGEN_SHIFT, SIM_SOPT7_ADC0ALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1TRGSEL[11:8] (RW)
 *
 * Selects the ADC1 trigger source when alternative triggers are functional in
 * Stop and VLPS modes.
 *
 * Values:
 * - 0b0000 - External trigger pin input (PDB_EXTRG0)
 * - 0b0001 - CMP0 output
 * - 0b0010 - CMP1 output
 * - 0b0011 - External trigger pin input (PDB_EXTRG1)
 * - 0b0100 - DMA channel 0 transfer last write complete
 * - 0b0101 - DMA channel 1 transfer last write complete
 * - 0b0110 - DMA channel 2 transfer last write complete
 * - 0b0111 - DMA channel 3 transfer last write complete
 * - 0b1000 - FTM0 intialtrig or external trig output
 * - 0b1001 - FTM1 intial trig or external trig output
 * - 0b1010 - FTM2 intial trig or external trig output
 * - 0b1011 - FTM3 intial trig or external trig output
 * - 0b1100 - FTM4 intial trig or external trig output
 * - 0b1101 - FTM5 intial trig or external trig output
 * - 0b1110 - LPTMR0 trigger
 * - 0b1111 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1TRGSEL field. */
#define SIM_RD_SOPT7_ADC1TRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1TRGSEL_MASK) >> SIM_SOPT7_ADC1TRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC1TRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1TRGSEL_SHIFT, SIM_SOPT7_ADC1TRGSEL_WIDTH))

/*! @brief Set the ADC1TRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC1TRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1TRGSEL_MASK, SIM_SOPT7_ADC1TRGSEL(value)))
#define SIM_BWR_SOPT7_ADC1TRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1TRGSEL_SHIFT), SIM_SOPT7_ADC1TRGSEL_SHIFT, SIM_SOPT7_ADC1TRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1PRETRGSEL[12] (RW)
 *
 * Selects the ADC1 pre-trigger source when alternative triggers are enabled
 * through ADC1ALTTRGEN.
 *
 * Values:
 * - 0b0 - Pre-trigger A for ADC1. Clearing this field will result in ADHWTSA=1
 *     and ADHWTSB=0.
 * - 0b1 - Pre-trigger B for ADC1. Setting this bit will result in ADHWTSA=0 and
 *     ADHWTSB=1.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1PRETRGSEL field. */
#define SIM_RD_SOPT7_ADC1PRETRGSEL(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1PRETRGSEL_MASK) >> SIM_SOPT7_ADC1PRETRGSEL_SHIFT)
#define SIM_BRD_SOPT7_ADC1PRETRGSEL(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1PRETRGSEL_SHIFT, SIM_SOPT7_ADC1PRETRGSEL_WIDTH))

/*! @brief Set the ADC1PRETRGSEL field to a new value. */
#define SIM_WR_SOPT7_ADC1PRETRGSEL(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1PRETRGSEL_MASK, SIM_SOPT7_ADC1PRETRGSEL(value)))
#define SIM_BWR_SOPT7_ADC1PRETRGSEL(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1PRETRGSEL_SHIFT), SIM_SOPT7_ADC1PRETRGSEL_SHIFT, SIM_SOPT7_ADC1PRETRGSEL_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTTRGEN[15:14] (RW)
 *
 * Enable alternative conversion triggers for ADC1.
 *
 * Values:
 * - 0b00 - PDB0 CH1 triggers ADC1
 * - 0b01 - PDB1 CH1 triggers ADC1
 * - 0b10 - Alt trigger source ADC1TRGSEL
 * - 0b11 - PDB0 CH1 OR PDB1 CH1 trigger ADC1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1ALTTRGEN field. */
#define SIM_RD_SOPT7_ADC1ALTTRGEN(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1ALTTRGEN_MASK) >> SIM_SOPT7_ADC1ALTTRGEN_SHIFT)
#define SIM_BRD_SOPT7_ADC1ALTTRGEN(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1ALTTRGEN_SHIFT, SIM_SOPT7_ADC1ALTTRGEN_WIDTH))

/*! @brief Set the ADC1ALTTRGEN field to a new value. */
#define SIM_WR_SOPT7_ADC1ALTTRGEN(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1ALTTRGEN_MASK, SIM_SOPT7_ADC1ALTTRGEN(value)))
#define SIM_BWR_SOPT7_ADC1ALTTRGEN(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1ALTTRGEN_SHIFT), SIM_SOPT7_ADC1ALTTRGEN_SHIFT, SIM_SOPT7_ADC1ALTTRGEN_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC0ALTCLKSRC[25:24] (RW)
 *
 * Selects the source for the ADC0 ALT clock.
 *
 * Values:
 * - 0b00 - OUTDIV5 output
 * - 0b01 - MCGIRCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC0ALTCLKSRC field. */
#define SIM_RD_SOPT7_ADC0ALTCLKSRC(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC0ALTCLKSRC_MASK) >> SIM_SOPT7_ADC0ALTCLKSRC_SHIFT)
#define SIM_BRD_SOPT7_ADC0ALTCLKSRC(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC0ALTCLKSRC_SHIFT, SIM_SOPT7_ADC0ALTCLKSRC_WIDTH))

/*! @brief Set the ADC0ALTCLKSRC field to a new value. */
#define SIM_WR_SOPT7_ADC0ALTCLKSRC(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC0ALTCLKSRC_MASK, SIM_SOPT7_ADC0ALTCLKSRC(value)))
#define SIM_BWR_SOPT7_ADC0ALTCLKSRC(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC0ALTCLKSRC_SHIFT), SIM_SOPT7_ADC0ALTCLKSRC_SHIFT, SIM_SOPT7_ADC0ALTCLKSRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT7, field ADC1ALTCLKSRC[27:26] (RW)
 *
 * Selects the source for the ADC1 ALT clock.
 *
 * Values:
 * - 0b00 - OUTDIV5 output
 * - 0b01 - MCGIRCLK
 * - 0b10 - OSCERCLK
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT7_ADC1ALTCLKSRC field. */
#define SIM_RD_SOPT7_ADC1ALTCLKSRC(base) ((SIM_SOPT7_REG(base) & SIM_SOPT7_ADC1ALTCLKSRC_MASK) >> SIM_SOPT7_ADC1ALTCLKSRC_SHIFT)
#define SIM_BRD_SOPT7_ADC1ALTCLKSRC(base) (BME_UBFX32(&SIM_SOPT7_REG(base), SIM_SOPT7_ADC1ALTCLKSRC_SHIFT, SIM_SOPT7_ADC1ALTCLKSRC_WIDTH))

/*! @brief Set the ADC1ALTCLKSRC field to a new value. */
#define SIM_WR_SOPT7_ADC1ALTCLKSRC(base, value) (SIM_RMW_SOPT7(base, SIM_SOPT7_ADC1ALTCLKSRC_MASK, SIM_SOPT7_ADC1ALTCLKSRC(value)))
#define SIM_BWR_SOPT7_ADC1ALTCLKSRC(base, value) (BME_BFI32(&SIM_SOPT7_REG(base), ((uint32_t)(value) << SIM_SOPT7_ADC1ALTCLKSRC_SHIFT), SIM_SOPT7_ADC1ALTCLKSRC_SHIFT, SIM_SOPT7_ADC1ALTCLKSRC_WIDTH))
/*@}*/

