RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*******************************************************************************
 * SIM_SOPT8 - System Options Register 8
 ******************************************************************************/

/*!
 * @brief SIM_SOPT8 - System Options Register 8 (RW)
 *
 * Reset value: 0x00000000U
 *
 * SOPT8[FTMxSYNCBIT] provides a mechanism to allow two or more FTMs to be
 * initialized at the same time. Each of the FTMs needs FTMx_SYNC[TRIG0] to be set
 * before software synchronization can occur. The user can perform a simultaneous
 * write of logic "1" to SOPT8[FTMxSYNCBIT], which sets FTMx_SYNC[TRIG0] input to
 * the corresponding FTM on the same bus clock cycle . The TRIGx inputs react to a
 * rising edge and the user must clear SOPT8[FTMxSYNCBIT] to allow other
 * hardware trigger inputs to force a synchronization/refresh event via FTMx_SYNC[TRIG0]
 * input.
 */
/*!
 * @name Constants and macros for entire SIM_SOPT8 register
 */
/*@{*/
#define SIM_RD_SOPT8(base)       (SIM_SOPT8_REG(base))
#define SIM_WR_SOPT8(base, value) (SIM_SOPT8_REG(base) = (value))
#define SIM_RMW_SOPT8(base, mask, value) (SIM_WR_SOPT8(base, (SIM_RD_SOPT8(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT8(base, value) (BME_OR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT8(base, value) (BME_AND32(&SIM_SOPT8_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT8(base, value) (BME_XOR32(&SIM_SOPT8_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT8 bitfields
 */

/*!
 * @name Register SIM_SOPT8, field FTM0SYNCBIT[0] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM0; this allow the hardware trigger options to
 *     function as expected. See SOPT4[FTM0TRG0SRC].
 * - 0b1 - If TRIG0 enabled, this refreshes the FTM0CNTIN and all buffered
 *     registers of the FTM0 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0SYNCBIT field. */
#define SIM_RD_SOPT8_FTM0SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0SYNCBIT_MASK) >> SIM_SOPT8_FTM0SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM0SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0SYNCBIT_SHIFT, SIM_SOPT8_FTM0SYNCBIT_WIDTH))

/*! @brief Set the FTM0SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM0SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0SYNCBIT_MASK, SIM_SOPT8_FTM0SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM0SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0SYNCBIT_SHIFT), SIM_SOPT8_FTM0SYNCBIT_SHIFT, SIM_SOPT8_FTM0SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM1SYNCBIT[1] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM1; this allows the hardware trigger options to
 *     function as expected. See SOPT4[FTM1TRG0SRC].
 * - 0b1 - If TRIG0 enabled, this refreshes the FTM1CNTIN and all buffered
 *     registers of the FTM1 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM1SYNCBIT field. */
#define SIM_RD_SOPT8_FTM1SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM1SYNCBIT_MASK) >> SIM_SOPT8_FTM1SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM1SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM1SYNCBIT_SHIFT, SIM_SOPT8_FTM1SYNCBIT_WIDTH))

/*! @brief Set the FTM1SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM1SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM1SYNCBIT_MASK, SIM_SOPT8_FTM1SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM1SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM1SYNCBIT_SHIFT), SIM_SOPT8_FTM1SYNCBIT_SHIFT, SIM_SOPT8_FTM1SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2SYNCBIT[2] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM2; this allows the hardware trigger options to
 *     function as expected. See SOPT4[FTM2TRG0SRC].
 * - 0b1 - If TRIG0 is enabled, this refreshes the FTM2CNTIN and all buffered
 *     registers of the FTM2 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2SYNCBIT field. */
#define SIM_RD_SOPT8_FTM2SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2SYNCBIT_MASK) >> SIM_SOPT8_FTM2SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM2SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2SYNCBIT_SHIFT, SIM_SOPT8_FTM2SYNCBIT_WIDTH))

/*! @brief Set the FTM2SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM2SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2SYNCBIT_MASK, SIM_SOPT8_FTM2SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM2SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2SYNCBIT_SHIFT), SIM_SOPT8_FTM2SYNCBIT_SHIFT, SIM_SOPT8_FTM2SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM3SYNCBIT[3] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM3; this allows the hardware trigger options to
 *     function as expected. See SOPT6[FTM3TRG0SRC].
 * - 0b1 - If TRIG0 is enabled, this refreshes the FTM3CNTIN and allbuffered
 *     registers of the FTM3 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM3SYNCBIT field. */
#define SIM_RD_SOPT8_FTM3SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM3SYNCBIT_MASK) >> SIM_SOPT8_FTM3SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM3SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM3SYNCBIT_SHIFT, SIM_SOPT8_FTM3SYNCBIT_WIDTH))

/*! @brief Set the FTM3SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM3SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM3SYNCBIT_MASK, SIM_SOPT8_FTM3SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM3SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM3SYNCBIT_SHIFT), SIM_SOPT8_FTM3SYNCBIT_SHIFT, SIM_SOPT8_FTM3SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM4SYNCBIT[4] (RW)
 *
 * Values:
 * - 0b0 - No effect to FTM4; this allows the hardware trigger options to
 *     function as expected. See SOPT6[FTM4TRG0SRC].
 * - 0b1 - If TRIG0 is enabled, this refreshes the FTM4CNTIN and allbuffered
 *     registers of the FTM4 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM4SYNCBIT field. */
#define SIM_RD_SOPT8_FTM4SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM4SYNCBIT_MASK) >> SIM_SOPT8_FTM4SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM4SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM4SYNCBIT_SHIFT, SIM_SOPT8_FTM4SYNCBIT_WIDTH))

/*! @brief Set the FTM4SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM4SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM4SYNCBIT_MASK, SIM_SOPT8_FTM4SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM4SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM4SYNCBIT_SHIFT), SIM_SOPT8_FTM4SYNCBIT_SHIFT, SIM_SOPT8_FTM4SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM5SYNCBIT[5] (RW)
 *
 * Values:
 * - 0b0 - No effect on FTM5; this allows the hardware trigger options to
 *     function as expected. See SOPT6[FTM5TRG0SRC].
 * - 0b1 - If TRIG0 is enabled, this refreshes the FTM5CNTIN and allbuffered
 *     registers of the FTM5 (must write 0 first then write 1); this masks the
 *     hardware trigger.
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM5SYNCBIT field. */
#define SIM_RD_SOPT8_FTM5SYNCBIT(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM5SYNCBIT_MASK) >> SIM_SOPT8_FTM5SYNCBIT_SHIFT)
#define SIM_BRD_SOPT8_FTM5SYNCBIT(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM5SYNCBIT_SHIFT, SIM_SOPT8_FTM5SYNCBIT_WIDTH))

/*! @brief Set the FTM5SYNCBIT field to a new value. */
#define SIM_WR_SOPT8_FTM5SYNCBIT(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM5SYNCBIT_MASK, SIM_SOPT8_FTM5SYNCBIT(value)))
#define SIM_BWR_SOPT8_FTM5SYNCBIT(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM5SYNCBIT_SHIFT), SIM_SOPT8_FTM5SYNCBIT_SHIFT, SIM_SOPT8_FTM5SYNCBIT_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field CARRIER_SELECT0[9:8] (RW)
 *
 * Values:
 * - 0b00 - FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 * - 0b01 - LPTMR0 prescaler output provides the carrier signal for Timer
 *     Modulation mode
 * - 0b10 - FTM5_CH1 output provides the carrier signal for Timer Modulation mode
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_CARRIER_SELECT0 field. */
#define SIM_RD_SOPT8_CARRIER_SELECT0(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_CARRIER_SELECT0_MASK) >> SIM_SOPT8_CARRIER_SELECT0_SHIFT)
#define SIM_BRD_SOPT8_CARRIER_SELECT0(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_CARRIER_SELECT0_SHIFT, SIM_SOPT8_CARRIER_SELECT0_WIDTH))

/*! @brief Set the CARRIER_SELECT0 field to a new value. */
#define SIM_WR_SOPT8_CARRIER_SELECT0(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_CARRIER_SELECT0_MASK, SIM_SOPT8_CARRIER_SELECT0(value)))
#define SIM_BWR_SOPT8_CARRIER_SELECT0(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_CARRIER_SELECT0_SHIFT), SIM_SOPT8_CARRIER_SELECT0_SHIFT, SIM_SOPT8_CARRIER_SELECT0_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH0SRC[16] (RW)
 *
 * Selects the source for FTM0 channel 0 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP
 * - 0b1 - FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH0SRC field. */
#define SIM_RD_SOPT8_FTM0OCH0SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH0SRC_MASK) >> SIM_SOPT8_FTM0OCH0SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH0SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH0SRC_SHIFT, SIM_SOPT8_FTM0OCH0SRC_WIDTH))

/*! @brief Set the FTM0OCH0SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH0SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH0SRC_MASK, SIM_SOPT8_FTM0OCH0SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH0SRC_SHIFT), SIM_SOPT8_FTM0OCH0SRC_SHIFT, SIM_SOPT8_FTM0OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH1SRC[17] (RW)
 *
 * Selects the source for FTM0 channel 1 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP
 * - 0b1 - FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH1SRC field. */
#define SIM_RD_SOPT8_FTM0OCH1SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH1SRC_MASK) >> SIM_SOPT8_FTM0OCH1SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH1SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH1SRC_SHIFT, SIM_SOPT8_FTM0OCH1SRC_WIDTH))

/*! @brief Set the FTM0OCH1SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH1SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH1SRC_MASK, SIM_SOPT8_FTM0OCH1SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH1SRC_SHIFT), SIM_SOPT8_FTM0OCH1SRC_SHIFT, SIM_SOPT8_FTM0OCH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH2SRC[18] (RW)
 *
 * Selects the source for FTM0 channel 2 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP
 * - 0b1 - FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH2SRC field. */
#define SIM_RD_SOPT8_FTM0OCH2SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH2SRC_MASK) >> SIM_SOPT8_FTM0OCH2SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH2SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH2SRC_SHIFT, SIM_SOPT8_FTM0OCH2SRC_WIDTH))

/*! @brief Set the FTM0OCH2SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH2SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH2SRC_MASK, SIM_SOPT8_FTM0OCH2SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH2SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH2SRC_SHIFT), SIM_SOPT8_FTM0OCH2SRC_SHIFT, SIM_SOPT8_FTM0OCH2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH3SRC[19] (RW)
 *
 * Selects the source for FTM0 channel 3 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP
 * - 0b1 - FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH3SRC field. */
#define SIM_RD_SOPT8_FTM0OCH3SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH3SRC_MASK) >> SIM_SOPT8_FTM0OCH3SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH3SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH3SRC_SHIFT, SIM_SOPT8_FTM0OCH3SRC_WIDTH))

/*! @brief Set the FTM0OCH3SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH3SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH3SRC_MASK, SIM_SOPT8_FTM0OCH3SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH3SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH3SRC_SHIFT), SIM_SOPT8_FTM0OCH3SRC_SHIFT, SIM_SOPT8_FTM0OCH3SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH4SRC[20] (RW)
 *
 * Selects the source for FTM0 channel 4 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP
 * - 0b1 - FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH4SRC field. */
#define SIM_RD_SOPT8_FTM0OCH4SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH4SRC_MASK) >> SIM_SOPT8_FTM0OCH4SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH4SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH4SRC_SHIFT, SIM_SOPT8_FTM0OCH4SRC_WIDTH))

/*! @brief Set the FTM0OCH4SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH4SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH4SRC_MASK, SIM_SOPT8_FTM0OCH4SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH4SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH4SRC_SHIFT), SIM_SOPT8_FTM0OCH4SRC_SHIFT, SIM_SOPT8_FTM0OCH4SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM0OCH5SRC[21] (RW)
 *
 * Selects the source for FTM0 channel 5 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP
 * - 0b1 - FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM0OCH5SRC field. */
#define SIM_RD_SOPT8_FTM0OCH5SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM0OCH5SRC_MASK) >> SIM_SOPT8_FTM0OCH5SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM0OCH5SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM0OCH5SRC_SHIFT, SIM_SOPT8_FTM0OCH5SRC_WIDTH))

/*! @brief Set the FTM0OCH5SRC field to a new value. */
#define SIM_WR_SOPT8_FTM0OCH5SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM0OCH5SRC_MASK, SIM_SOPT8_FTM0OCH5SRC(value)))
#define SIM_BWR_SOPT8_FTM0OCH5SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM0OCH5SRC_SHIFT), SIM_SOPT8_FTM0OCH5SRC_SHIFT, SIM_SOPT8_FTM0OCH5SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH0SRC[22] (RW)
 *
 * Selects the source for FTM2 channel 0 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP
 * - 0b1 - FTM2CH0 pin is the output of FTM2 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2OCH0SRC field. */
#define SIM_RD_SOPT8_FTM2OCH0SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2OCH0SRC_MASK) >> SIM_SOPT8_FTM2OCH0SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM2OCH0SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2OCH0SRC_SHIFT, SIM_SOPT8_FTM2OCH0SRC_WIDTH))

