RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*! @brief Set the FTM2OCH0SRC field to a new value. */
#define SIM_WR_SOPT8_FTM2OCH0SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2OCH0SRC_MASK, SIM_SOPT8_FTM2OCH0SRC(value)))
#define SIM_BWR_SOPT8_FTM2OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2OCH0SRC_SHIFT), SIM_SOPT8_FTM2OCH0SRC_SHIFT, SIM_SOPT8_FTM2OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT8, field FTM2OCH1SRC[23] (RW)
 *
 * Selects the source for FTM2 channel 1 PWM/OCMP mode. When the FTM is not in
 * output PWM/OCMP mode, clear this field.
 *
 * Values:
 * - 0b0 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP
 * - 0b1 - FTM2CH1 pin is the output of FTM2 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT0
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT8_FTM2OCH1SRC field. */
#define SIM_RD_SOPT8_FTM2OCH1SRC(base) ((SIM_SOPT8_REG(base) & SIM_SOPT8_FTM2OCH1SRC_MASK) >> SIM_SOPT8_FTM2OCH1SRC_SHIFT)
#define SIM_BRD_SOPT8_FTM2OCH1SRC(base) (BME_UBFX32(&SIM_SOPT8_REG(base), SIM_SOPT8_FTM2OCH1SRC_SHIFT, SIM_SOPT8_FTM2OCH1SRC_WIDTH))

/*! @brief Set the FTM2OCH1SRC field to a new value. */
#define SIM_WR_SOPT8_FTM2OCH1SRC(base, value) (SIM_RMW_SOPT8(base, SIM_SOPT8_FTM2OCH1SRC_MASK, SIM_SOPT8_FTM2OCH1SRC(value)))
#define SIM_BWR_SOPT8_FTM2OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT8_REG(base), ((uint32_t)(value) << SIM_SOPT8_FTM2OCH1SRC_SHIFT), SIM_SOPT8_FTM2OCH1SRC_SHIFT, SIM_SOPT8_FTM2OCH1SRC_WIDTH))
/*@}*/

/*******************************************************************************
 * SIM_SOPT9 - System Options Register 9
 ******************************************************************************/

/*!
 * @brief SIM_SOPT9 - System Options Register 9 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_SOPT9 register
 */
/*@{*/
#define SIM_RD_SOPT9(base)       (SIM_SOPT9_REG(base))
#define SIM_WR_SOPT9(base, value) (SIM_SOPT9_REG(base) = (value))
#define SIM_RMW_SOPT9(base, mask, value) (SIM_WR_SOPT9(base, (SIM_RD_SOPT9(base) & ~(mask)) | (value)))
#define SIM_SET_SOPT9(base, value) (BME_OR32(&SIM_SOPT9_REG(base), (uint32_t)(value)))
#define SIM_CLR_SOPT9(base, value) (BME_AND32(&SIM_SOPT9_REG(base), (uint32_t)(~(value))))
#define SIM_TOG_SOPT9(base, value) (BME_XOR32(&SIM_SOPT9_REG(base), (uint32_t)(value)))
/*@}*/

/*
 * Constants & macros for individual SIM_SOPT9 bitfields
 */

/*!
 * @name Register SIM_SOPT9, field CARRIER_SELECT1[9:8] (RW)
 *
 * Values:
 * - 0b00 - FTM1_CH1 output provides the carrier signal for Timer Modulation mode
 * - 0b01 - LPTMR0 prescaler output provides the carrier signal for Timer
 *     Modulation mode
 * - 0b10 - FTM5_CH1 output provides the carrier signal for Timer Modulation mode
 * - 0b11 - Reserved
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_CARRIER_SELECT1 field. */
#define SIM_RD_SOPT9_CARRIER_SELECT1(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_CARRIER_SELECT1_MASK) >> SIM_SOPT9_CARRIER_SELECT1_SHIFT)
#define SIM_BRD_SOPT9_CARRIER_SELECT1(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_CARRIER_SELECT1_SHIFT, SIM_SOPT9_CARRIER_SELECT1_WIDTH))

/*! @brief Set the CARRIER_SELECT1 field to a new value. */
#define SIM_WR_SOPT9_CARRIER_SELECT1(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_CARRIER_SELECT1_MASK, SIM_SOPT9_CARRIER_SELECT1(value)))
#define SIM_BWR_SOPT9_CARRIER_SELECT1(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_CARRIER_SELECT1_SHIFT), SIM_SOPT9_CARRIER_SELECT1_SHIFT, SIM_SOPT9_CARRIER_SELECT1_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH0SRC[16] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH0 pin is the output of FTM3 channel 0 PWM/OCMP
 * - 0b1 - FTM3CH0 pin is the output of FTM3 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH0SRC field. */
#define SIM_RD_SOPT9_FTM3OCH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH0SRC_MASK) >> SIM_SOPT9_FTM3OCH0SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH0SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH0SRC_SHIFT, SIM_SOPT9_FTM3OCH0SRC_WIDTH))

/*! @brief Set the FTM3OCH0SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH0SRC_MASK, SIM_SOPT9_FTM3OCH0SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH0SRC_SHIFT), SIM_SOPT9_FTM3OCH0SRC_SHIFT, SIM_SOPT9_FTM3OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH1SRC[17] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH1 pin is the output of FTM3 channel 1 PWM/OCMP
 * - 0b1 - FTM3CH1 pin is the output of FTM3 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH1SRC field. */
#define SIM_RD_SOPT9_FTM3OCH1SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH1SRC_MASK) >> SIM_SOPT9_FTM3OCH1SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH1SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH1SRC_SHIFT, SIM_SOPT9_FTM3OCH1SRC_WIDTH))

/*! @brief Set the FTM3OCH1SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH1SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH1SRC_MASK, SIM_SOPT9_FTM3OCH1SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH1SRC_SHIFT), SIM_SOPT9_FTM3OCH1SRC_SHIFT, SIM_SOPT9_FTM3OCH1SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH2SRC[18] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH2 pin is the output of FTM3 channel 2 PWM/OCMP
 * - 0b1 - FTM3CH2 pin is the output of FTM3 channel 2 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH2SRC field. */
#define SIM_RD_SOPT9_FTM3OCH2SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH2SRC_MASK) >> SIM_SOPT9_FTM3OCH2SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH2SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH2SRC_SHIFT, SIM_SOPT9_FTM3OCH2SRC_WIDTH))

/*! @brief Set the FTM3OCH2SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH2SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH2SRC_MASK, SIM_SOPT9_FTM3OCH2SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH2SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH2SRC_SHIFT), SIM_SOPT9_FTM3OCH2SRC_SHIFT, SIM_SOPT9_FTM3OCH2SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH3SRC[19] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH3 pin is the output of FTM3 channel 3 PWM/OCMP
 * - 0b1 - FTM3CH3 pin is the output of FTM3 channel 3 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH3SRC field. */
#define SIM_RD_SOPT9_FTM3OCH3SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH3SRC_MASK) >> SIM_SOPT9_FTM3OCH3SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH3SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH3SRC_SHIFT, SIM_SOPT9_FTM3OCH3SRC_WIDTH))

/*! @brief Set the FTM3OCH3SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH3SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH3SRC_MASK, SIM_SOPT9_FTM3OCH3SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH3SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH3SRC_SHIFT), SIM_SOPT9_FTM3OCH3SRC_SHIFT, SIM_SOPT9_FTM3OCH3SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH4SRC[20] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH4 pin is the output of FTM3 channel 4 PWM/OCMP
 * - 0b1 - FTM3CH4 pin is the output of FTM3 channel 4 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH4SRC field. */
#define SIM_RD_SOPT9_FTM3OCH4SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH4SRC_MASK) >> SIM_SOPT9_FTM3OCH4SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH4SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH4SRC_SHIFT, SIM_SOPT9_FTM3OCH4SRC_WIDTH))

/*! @brief Set the FTM3OCH4SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH4SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH4SRC_MASK, SIM_SOPT9_FTM3OCH4SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH4SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH4SRC_SHIFT), SIM_SOPT9_FTM3OCH4SRC_SHIFT, SIM_SOPT9_FTM3OCH4SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM3OCH5SRC[21] (RW)
 *
 * Values:
 * - 0b0 - FTM3CH5 pin is the output of FTM3 channel 5 PWM/OCMP
 * - 0b1 - FTM3CH5 pin is the output of FTM3 channel 5 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM3OCH5SRC field. */
#define SIM_RD_SOPT9_FTM3OCH5SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM3OCH5SRC_MASK) >> SIM_SOPT9_FTM3OCH5SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM3OCH5SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM3OCH5SRC_SHIFT, SIM_SOPT9_FTM3OCH5SRC_WIDTH))

/*! @brief Set the FTM3OCH5SRC field to a new value. */
#define SIM_WR_SOPT9_FTM3OCH5SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM3OCH5SRC_MASK, SIM_SOPT9_FTM3OCH5SRC(value)))
#define SIM_BWR_SOPT9_FTM3OCH5SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM3OCH5SRC_SHIFT), SIM_SOPT9_FTM3OCH5SRC_SHIFT, SIM_SOPT9_FTM3OCH5SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM4OCH0SRC[22] (RW)
 *
 * Values:
 * - 0b0 - FTM4CH0 pin is the output of FTM4 channel 0 PWM/OCMP
 * - 0b1 - FTM4CH0 pin is the output of FTM4 channel 0 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM4OCH0SRC field. */
#define SIM_RD_SOPT9_FTM4OCH0SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM4OCH0SRC_MASK) >> SIM_SOPT9_FTM4OCH0SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM4OCH0SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM4OCH0SRC_SHIFT, SIM_SOPT9_FTM4OCH0SRC_WIDTH))

/*! @brief Set the FTM4OCH0SRC field to a new value. */
#define SIM_WR_SOPT9_FTM4OCH0SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM4OCH0SRC_MASK, SIM_SOPT9_FTM4OCH0SRC(value)))
#define SIM_BWR_SOPT9_FTM4OCH0SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM4OCH0SRC_SHIFT), SIM_SOPT9_FTM4OCH0SRC_SHIFT, SIM_SOPT9_FTM4OCH0SRC_WIDTH))
/*@}*/

/*!
 * @name Register SIM_SOPT9, field FTM4OCH1SRC[23] (RW)
 *
 * Values:
 * - 0b0 - FTM4CH1 pin is the output of FTM4 channel 1 PWM/OCMP
 * - 0b1 - FTM4CH1 pin is the output of FTM4 channel 1 PWM/OCMP modulating the
 *     carrier frequency, as per CARRIER_SELECT1
 */
/*@{*/
/*! @brief Read current value of the SIM_SOPT9_FTM4OCH1SRC field. */
#define SIM_RD_SOPT9_FTM4OCH1SRC(base) ((SIM_SOPT9_REG(base) & SIM_SOPT9_FTM4OCH1SRC_MASK) >> SIM_SOPT9_FTM4OCH1SRC_SHIFT)
#define SIM_BRD_SOPT9_FTM4OCH1SRC(base) (BME_UBFX32(&SIM_SOPT9_REG(base), SIM_SOPT9_FTM4OCH1SRC_SHIFT, SIM_SOPT9_FTM4OCH1SRC_WIDTH))

/*! @brief Set the FTM4OCH1SRC field to a new value. */
#define SIM_WR_SOPT9_FTM4OCH1SRC(base, value) (SIM_RMW_SOPT9(base, SIM_SOPT9_FTM4OCH1SRC_MASK, SIM_SOPT9_FTM4OCH1SRC(value)))
#define SIM_BWR_SOPT9_FTM4OCH1SRC(base, value) (BME_BFI32(&SIM_SOPT9_REG(base), ((uint32_t)(value) << SIM_SOPT9_FTM4OCH1SRC_SHIFT), SIM_SOPT9_FTM4OCH1SRC_SHIFT, SIM_SOPT9_FTM4OCH1SRC_WIDTH))
/*@}*/

