RT-Thread/rt-thread/bsp/freescale/platform/devices/MKV11Z7/include/MKV11Z7_extension.h
/*******************************************************************************
 * SPI_TXFR3 - Transmit FIFO Registers
 ******************************************************************************/

/*!
 * @brief SPI_TXFR3 - Transmit FIFO Registers (RO)
 *
 * Reset value: 0x00000000U
 *
 * TXFRn registers provide visibility into the TX FIFO for debugging purposes.
 * Each register is an entry in the TX FIFO. The registers are read-only and
 * cannot be modified. Reading the TXFRx registers does not alter the state of the TX
 * FIFO.
 */
/*!
 * @name Constants and macros for entire SPI_TXFR3 register
 */
/*@{*/
#define SPI_RD_TXFR3(base)       (SPI_TXFR3_REG(base))
/*@}*/

/*
 * Constants & macros for individual SPI_TXFR3 bitfields
 */

/*!
 * @name Register SPI_TXFR3, field TXDATA[15:0] (RO)
 *
 * Contains the SPI data to be shifted out.
 */
/*@{*/
/*! @brief Read current value of the SPI_TXFR3_TXDATA field. */
#define SPI_RD_TXFR3_TXDATA(base) ((SPI_TXFR3_REG(base) & SPI_TXFR3_TXDATA_MASK) >> SPI_TXFR3_TXDATA_SHIFT)
#define SPI_BRD_TXFR3_TXDATA(base) (BME_UBFX32(&SPI_TXFR3_REG(base), SPI_TXFR3_TXDATA_SHIFT, SPI_TXFR3_TXDATA_WIDTH))
/*@}*/

/*!
 * @name Register SPI_TXFR3, field TXCMD_TXDATA[31:16] (RO)
 *
 * In Master mode the TXCMD field contains the command that sets the transfer
 * attributes for the SPI data. In Slave mode, this field is reserved.
 */
/*@{*/
/*! @brief Read current value of the SPI_TXFR3_TXCMD_TXDATA field. */
#define SPI_RD_TXFR3_TXCMD_TXDATA(base) ((SPI_TXFR3_REG(base) & SPI_TXFR3_TXCMD_TXDATA_MASK) >> SPI_TXFR3_TXCMD_TXDATA_SHIFT)
#define SPI_BRD_TXFR3_TXCMD_TXDATA(base) (BME_UBFX32(&SPI_TXFR3_REG(base), SPI_TXFR3_TXCMD_TXDATA_SHIFT, SPI_TXFR3_TXCMD_TXDATA_WIDTH))
/*@}*/

/*******************************************************************************
 * SPI_RXFR0 - Receive FIFO Registers
 ******************************************************************************/

/*!
 * @brief SPI_RXFR0 - Receive FIFO Registers (RO)
 *
 * Reset value: 0x00000000U
 *
 * RXFRn provide visibility into the RX FIFO for debugging purposes. Each
 * register is an entry in the RX FIFO. The RXFR registers are read-only. Reading the
 * RXFRx registers does not alter the state of the RX FIFO.
 */
/*!
 * @name Constants and macros for entire SPI_RXFR0 register
 */
/*@{*/
#define SPI_RD_RXFR0(base)       (SPI_RXFR0_REG(base))
/*@}*/

/*******************************************************************************
 * SPI_RXFR1 - Receive FIFO Registers
 ******************************************************************************/

/*!
 * @brief SPI_RXFR1 - Receive FIFO Registers (RO)
 *
 * Reset value: 0x00000000U
 *
 * RXFRn provide visibility into the RX FIFO for debugging purposes. Each
 * register is an entry in the RX FIFO. The RXFR registers are read-only. Reading the
 * RXFRx registers does not alter the state of the RX FIFO.
 */
/*!
 * @name Constants and macros for entire SPI_RXFR1 register
 */
/*@{*/
#define SPI_RD_RXFR1(base)       (SPI_RXFR1_REG(base))
/*@}*/

/*******************************************************************************
 * SPI_RXFR2 - Receive FIFO Registers
 ******************************************************************************/

/*!
 * @brief SPI_RXFR2 - Receive FIFO Registers (RO)
 *
 * Reset value: 0x00000000U
 *
 * RXFRn provide visibility into the RX FIFO for debugging purposes. Each
 * register is an entry in the RX FIFO. The RXFR registers are read-only. Reading the
 * RXFRx registers does not alter the state of the RX FIFO.
 */
/*!
 * @name Constants and macros for entire SPI_RXFR2 register
 */
/*@{*/
#define SPI_RD_RXFR2(base)       (SPI_RXFR2_REG(base))
/*@}*/

/*******************************************************************************
 * SPI_RXFR3 - Receive FIFO Registers
 ******************************************************************************/

/*!
 * @brief SPI_RXFR3 - Receive FIFO Registers (RO)
 *
 * Reset value: 0x00000000U
 *
 * RXFRn provide visibility into the RX FIFO for debugging purposes. Each
 * register is an entry in the RX FIFO. The RXFR registers are read-only. Reading the
 * RXFRx registers does not alter the state of the RX FIFO.
 */
/*!
 * @name Constants and macros for entire SPI_RXFR3 register
 */
/*@{*/
#define SPI_RD_RXFR3(base)       (SPI_RXFR3_REG(base))
/*@}*/

/*******************************************************************************
 * SPI_SREX - Status Register Extended
 ******************************************************************************/

/*!
 * @brief SPI_SREX - Status Register Extended (RO)
 *
 * Reset value: 0x00000000U
 *
 * The register contains status fields. The fields reflect the status of the
 * module and indicate the occurrence of events. This register is not writable.
 */
/*!
 * @name Constants and macros for entire SPI_SREX register
 */
/*@{*/
#define SPI_RD_SREX(base)        (SPI_SREX_REG(base))
/*@}*/

/*
 * Constants & macros for individual SPI_SREX bitfields
 */

/*!
 * @name Register SPI_SREX, field CMDNXTPTR[3:0] (RO)
 *
 * Indicates which CMD FIFO Entry is used during the next transfer. The
 * CMDNXTPTR field is updated every time SPI data due to current command have been
 * transmitted.
 */
/*@{*/
/*! @brief Read current value of the SPI_SREX_CMDNXTPTR field. */
#define SPI_RD_SREX_CMDNXTPTR(base) ((SPI_SREX_REG(base) & SPI_SREX_CMDNXTPTR_MASK) >> SPI_SREX_CMDNXTPTR_SHIFT)
#define SPI_BRD_SREX_CMDNXTPTR(base) (BME_UBFX32(&SPI_SREX_REG(base), SPI_SREX_CMDNXTPTR_SHIFT, SPI_SREX_CMDNXTPTR_WIDTH))
/*@}*/

/*!
 * @name Register SPI_SREX, field CMDCTR[8:4] (RO)
 *
 * Indicates the number of entries in the CMD FIFO. The CMDCTR is incremented
 * every time the command part of PUSHR is written. The CMDCTR is decremented every
 * time a SPI command is executed (all data frames due to current command frame
 * have been transmitted).
 */
/*@{*/
/*! @brief Read current value of the SPI_SREX_CMDCTR field. */
#define SPI_RD_SREX_CMDCTR(base) ((SPI_SREX_REG(base) & SPI_SREX_CMDCTR_MASK) >> SPI_SREX_CMDCTR_SHIFT)
#define SPI_BRD_SREX_CMDCTR(base) (BME_UBFX32(&SPI_SREX_REG(base), SPI_SREX_CMDCTR_SHIFT, SPI_SREX_CMDCTR_WIDTH))
/*@}*/

/*!
 * @name Register SPI_SREX, field TXCTR4[11] (RO)
 *
 * This bit is an extension of SR[TXCTR]. The concatenated field {TXCTR4, TXCTR}
 * indicates the number of valid entries in the TX FIFO. This field is
 * incremented every time the PUSHR is written. And this field is decremented every time
 * an SPI command is executed and the SPI data is transferred to the shift
 * register.
 */
/*@{*/
/*! @brief Read current value of the SPI_SREX_TXCTR4 field. */
#define SPI_RD_SREX_TXCTR4(base) ((SPI_SREX_REG(base) & SPI_SREX_TXCTR4_MASK) >> SPI_SREX_TXCTR4_SHIFT)
#define SPI_BRD_SREX_TXCTR4(base) (BME_UBFX32(&SPI_SREX_REG(base), SPI_SREX_TXCTR4_SHIFT, SPI_SREX_TXCTR4_WIDTH))
/*@}*/

/*!
 * @name Register SPI_SREX, field RXCTR4[14] (RO)
 *
 * This bit is an extension of SR[RXCTR]. The concatenated field {RXCTR4, RXCTR}
 * indicates the number of entries in the RX FIFO. This field is decremented
 * every time the POPR is read. And this field is incremented every time data is
 * transferred from the shift register to the RX FIFO.
 */
/*@{*/
/*! @brief Read current value of the SPI_SREX_RXCTR4 field. */
#define SPI_RD_SREX_RXCTR4(base) ((SPI_SREX_REG(base) & SPI_SREX_RXCTR4_MASK) >> SPI_SREX_RXCTR4_SHIFT)
#define SPI_BRD_SREX_RXCTR4(base) (BME_UBFX32(&SPI_SREX_REG(base), SPI_SREX_RXCTR4_SHIFT, SPI_SREX_RXCTR4_WIDTH))
/*@}*/

